 # Іноді нам потрібно працювати не з усіма даними, а тільки з певними стовпцями. Щоб це зробити, ми можемо вибрати лише одну колонку або декілька, після того як відфільтруємо дані за певною умовою.
#
# Якщо потрібно вивести одну колонку:
# df[df['Rating'] > 5]['Title']
#
# df[df['Rating'] > 5] — це фільтрація: ми вибираємо тільки ті фільми, у яких рейтинг більше 5;
# ['Title'] — вибираємо лише стовпець "Title" (назви фільмів).
#
# Якщо потрібно вивести кілька колонок:
# df[df['Rating'] > 5][['Title', 'Rating']]
#
# df[df['Rating'] > 5] — фільтрація фільмів з рейтингом більше 5;
# [['Title', 'Rating']] — вибір двох колонок: "Title" та "Rating".
#
# Загальне правило:
#
#  Спочатку пишемо умову фільтрації: df[умова].
#
#  Потім вказуємо колонку або список колонок, які хочемо побачити: [['Назва_стовпця1', 'Назва_стовпця2']].
#
# Завдання! Виведи тільки назви фільмів та роки їх випуску для фільмів певного жанру (наприклад, "Comedy").
import pandas as pd


df = pd.read_csv("movies_dataset.csv").dropna()
# print(df[df['genres'] == "Comedy"][['Title', 'Year']])
info = (df[df['genres'].str.contains("Comedy")][["Title", "Year"]])
print(info)


print(df.groupby('genres')['Rating'].mean())


print(df.sort_values('Title', ascending=False))

# Що тут відбувається?
#
# sort_values('Revenue'): сортує дані за стовпцем "Revenue" (дохід).
# ascending=False: означає сортування за спаданням (від найбільшого до найменшого).